Revit 2027 API
Stairs.ActualTreadsNumber Property
 The number of treads actually created in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ActualTreadsNumber { get; }
Public ReadOnly Property ActualTreadsNumber As Integer
	Get
public:
property int ActualTreadsNumber {
	int get ();
}
member ActualTreadsNumber : int with get
Property Value
Int32
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace